2019/06/pruebas-de-carga-y-rendimiento-de-un-servicio-web-con-apache-bench/code/ab.out
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking picodotdev.github.io (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        GitHub.com
Server Hostname:        picodotdev.github.io
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        picodotdev.github.io

Document Path:          /blog-bitix/
Document Length:        28389 bytes

Concurrency Level:      20
Time taken for tests:   29.220 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      29007394 bytes
HTML transferred:       28389000 bytes
Requests per second:    34.22 [#/sec] (mean)
Time per request:       584.404 [ms] (mean)
Time per request:       29.220 [ms] (mean, across all concurrent requests)
Transfer rate:          969.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      149  349 149.7    303    1361
Processing:   122  225  75.5    207     586
Waiting:       53  122  68.8    108     481
Total:        329  574 174.0    512    1612

Percentage of the requests served within a certain time (ms)
  50%    512
  66%    534
  75%    555
  80%    744
  90%    832
  95%    915
  98%   1104
  99%   1171
 100%   1612 (longest request)